Tympan/Tympan_Library/boards.txt
teensy3.name=Teensy 3.0
teensy3.upload.protocol=halfkay
teensy3.upload.maximum_size=131072
teensy3.upload.maximum_ram_size=16384
teensy3.upload.speed=12000000
teensy3.upload.disable_flushing=true
teensy3.bootloader.path=undefined
teensy3.serial.restart_cmd=true
teensy3.serial.safe_baud_rates_only=true
teensy3.upload.avrdude_wrapper=teensy_reboot
teensy3.build.mcu=mk20dx128
teensy3.build.cpu=cortex-m4
teensy3.build.option1=-mthumb
teensy3.build.option2=-nostdlib
teensy3.build.option3=-D__MK20DX128__
teensy3.build.option4=-DTEENSYDUINO=129
teensy3.build.option5=-fsingle-precision-constant
teensy3.build.cppoption1=-fno-rtti
teensy3.build.linkoption1=-mthumb
teensy3.build.linkoption2=--specs=nano.specs
teensy3.build.additionalobject1=-larm_cortexM4l_math
teensy3.build.linkscript=mk20dx128.ld
teensy3.build.architecture=arm
teensy3.build.command.gcc=arm-none-eabi-gcc
teensy3.build.command.g++=arm-none-eabi-g++
teensy3.build.command.ar=arm-none-eabi-ar
teensy3.build.command.objcopy=arm-none-eabi-objcopy
teensy3.build.command.objdump=arm-none-eabi-objdump
teensy3.build.command.size=arm-none-eabi-size
teensy3.build.core=teensy3
teensy3.build.elide_constructors=true
teensy3.build.gnu0x=true
teensy3.build.dependency=true
teensy3.build.time_t=true
teensy3.build.post_compile_script=teensy_post_compile
teensy3.menu.usb.serial.name=Serial
teensy3.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy3.menu.usb.hid.name=Keyboard + Mouse + Joystick
teensy3.menu.usb.hid.build.define0=-DUSB_HID
teensy3.menu.usb.hid.fake_serial=teensy_gateway
teensy3.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
teensy3.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensy3.menu.usb.midi.name=MIDI
teensy3.menu.usb.midi.build.define0=-DUSB_MIDI
teensy3.menu.usb.midi.fake_serial=teensy_gateway
teensy3.menu.usb.rawhid.name=Raw HID
teensy3.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy3.menu.usb.rawhid.fake_serial=teensy_gateway
teensy3.menu.usb.flightsim.name=Flight Sim Controls
teensy3.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy3.menu.usb.flightsim.fake_serial=teensy_gateway
teensy3.menu.usb.disable.name=No USB
teensy3.menu.usb.disable.build.define0=-DUSB_DISABLED
teensy3.menu.speed.96.name=96 MHz (overclock)
teensy3.menu.speed.48.name=48 MHz
teensy3.menu.speed.24.name=24 MHz
teensy3.menu.speed.96.build.f_cpu=96000000
teensy3.menu.speed.48.build.f_cpu=48000000
teensy3.menu.speed.24.build.f_cpu=24000000
teensy3.menu.keys.en-us.name=US English
teensy3.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy3.menu.keys.fr-ca.name=Canadian French
teensy3.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy3.menu.keys.xx-ca.name=Canadian Multilingual
teensy3.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy3.menu.keys.cz-cz.name=Czech
teensy3.menu.keys.cz-cz.build.define1=-DLAYOUT_CZECH
teensy3.menu.keys.da-da.name=Danish
teensy3.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy3.menu.keys.fi-fi.name=Finnish
teensy3.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy3.menu.keys.fr-fr.name=French
teensy3.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy3.menu.keys.fr-be.name=French Belgian
teensy3.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy3.menu.keys.fr-ch.name=French Swiss
teensy3.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy3.menu.keys.de-de.name=German
teensy3.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy3.menu.keys.de-dm.name=German (Mac)
teensy3.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy3.menu.keys.de-ch.name=German Swiss
teensy3.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy3.menu.keys.is-is.name=Icelandic
teensy3.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy3.menu.keys.en-ie.name=Irish
teensy3.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy3.menu.keys.it-it.name=Italian
teensy3.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy3.menu.keys.no-no.name=Norwegian
teensy3.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy3.menu.keys.pt-pt.name=Portuguese
teensy3.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy3.menu.keys.pt-br.name=Portuguese Brazilian
teensy3.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy3.menu.keys.es-es.name=Spanish
teensy3.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy3.menu.keys.es-mx.name=Spanish Latin America
teensy3.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy3.menu.keys.sv-se.name=Swedish
teensy3.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy3.menu.keys.tr-tr.name=Turkish (partial)
teensy3.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensy3.menu.keys.en-gb.name=United Kingdom
teensy3.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy3.menu.keys.usint.name=US International
teensy3.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensyLC.name=Teensy LC
teensyLC.upload.protocol=halfkay
teensyLC.upload.maximum_size=63488
teensyLC.upload.maximum_ram_size=8192
teensyLC.upload.speed=12000000
teensyLC.upload.disable_flushing=true
teensyLC.bootloader.path=undefined
teensyLC.serial.restart_cmd=true
teensyLC.serial.safe_baud_rates_only=true
teensyLC.upload.avrdude_wrapper=teensy_reboot
teensyLC.build.mcu=mkl26z64
teensyLC.build.cpu=cortex-m0plus
teensyLC.build.option1=-mthumb
teensyLC.build.option2=-nostdlib
teensyLC.build.option3=-D__MKL26Z64__
teensyLC.build.option4=-DTEENSYDUINO=129
teensyLC.build.option5=-fsingle-precision-constant
teensyLC.build.cppoption1=-fno-rtti
teensyLC.build.linkoption1=-mthumb
teensyLC.build.linkoption2=--specs=nano.specs
teensyLC.build.additionalobject1=-larm_cortexM0l_math
teensyLC.build.linkscript=mkl26z64.ld
teensyLC.build.architecture=arm
teensyLC.build.command.gcc=arm-none-eabi-gcc
teensyLC.build.command.g++=arm-none-eabi-g++
teensyLC.build.command.ar=arm-none-eabi-ar
teensyLC.build.command.objcopy=arm-none-eabi-objcopy
teensyLC.build.command.objdump=arm-none-eabi-objdump
teensyLC.build.command.size=arm-none-eabi-size
teensyLC.build.core=teensy3
teensyLC.build.elide_constructors=true
teensyLC.build.gnu0x=true
teensyLC.build.dependency=true
teensyLC.build.time_t=true
teensyLC.build.post_compile_script=teensy_post_compile
teensyLC.menu.usb.serial.name=Serial
teensyLC.menu.usb.serial.build.define0=-DUSB_SERIAL
teensyLC.menu.usb.hid.name=Keyboard + Mouse + Joystick
teensyLC.menu.usb.hid.build.define0=-DUSB_HID
teensyLC.menu.usb.hid.fake_serial=teensy_gateway
teensyLC.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
teensyLC.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensyLC.menu.usb.midi.name=MIDI
teensyLC.menu.usb.midi.build.define0=-DUSB_MIDI
teensyLC.menu.usb.midi.fake_serial=teensy_gateway
teensyLC.menu.usb.rawhid.name=Raw HID
teensyLC.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensyLC.menu.usb.rawhid.fake_serial=teensy_gateway
teensyLC.menu.usb.flightsim.name=Flight Sim Controls
teensyLC.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensyLC.menu.usb.flightsim.fake_serial=teensy_gateway
teensyLC.menu.usb.disable.name=No USB
teensyLC.menu.usb.disable.build.define0=-DUSB_DISABLED
teensyLC.menu.speed.48lc.name=48 MHz
teensyLC.menu.speed.24lc.name=24 MHz
teensyLC.menu.speed.48lc.build.f_cpu=48000000
teensyLC.menu.speed.24lc.build.f_cpu=24000000
teensyLC.menu.keys.en-us.name=US English
teensyLC.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensyLC.menu.keys.fr-ca.name=Canadian French
teensyLC.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensyLC.menu.keys.xx-ca.name=Canadian Multilingual
teensyLC.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensyLC.menu.keys.cz-cz.name=Czech
teensyLC.menu.keys.cz-cz.build.define1=-DLAYOUT_CZECH
teensyLC.menu.keys.da-da.name=Danish
teensyLC.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensyLC.menu.keys.fi-fi.name=Finnish
teensyLC.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensyLC.menu.keys.fr-fr.name=French
teensyLC.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensyLC.menu.keys.fr-be.name=French Belgian
teensyLC.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensyLC.menu.keys.fr-ch.name=French Swiss
teensyLC.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensyLC.menu.keys.de-de.name=German
teensyLC.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensyLC.menu.keys.de-dm.name=German (Mac)
teensyLC.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensyLC.menu.keys.de-ch.name=German Swiss
teensyLC.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensyLC.menu.keys.is-is.name=Icelandic
teensyLC.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensyLC.menu.keys.en-ie.name=Irish
teensyLC.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensyLC.menu.keys.it-it.name=Italian
teensyLC.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensyLC.menu.keys.no-no.name=Norwegian
teensyLC.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensyLC.menu.keys.pt-pt.name=Portuguese
teensyLC.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensyLC.menu.keys.pt-br.name=Portuguese Brazilian
teensyLC.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensyLC.menu.keys.es-es.name=Spanish
teensyLC.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensyLC.menu.keys.es-mx.name=Spanish Latin America
teensyLC.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensyLC.menu.keys.sv-se.name=Swedish
teensyLC.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensyLC.menu.keys.tr-tr.name=Turkish (partial)
teensyLC.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensyLC.menu.keys.en-gb.name=United Kingdom
teensyLC.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensyLC.menu.keys.usint.name=US International
teensyLC.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

